Manoharkuduchella/Manohar_BitLearn/Bitlearn_workspace/Microcontrollers/STM32/stm32l4_workspace_LL/24_UART_Driver/Src/main.c

#include "stm32l476xx.h"
#include "stm32l476xx_gpio_drivers.h"
#include "stm32l476xx_usart_driver.h"
#include <inttypes.h>

USART_Handle_t USARTHandle;


void UART_GPIO_Init()
{
    GPIO_Handle_t UARTPins;

    UARTPins.pGPIOx = GPIOA;

    UARTPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    UARTPins.GPIO_PinConfig.GPIO_PinAltFunMode = 7;
    UARTPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    UARTPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
    UARTPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

    /************ USART1_TX -> PA9 ************/
    UARTPins.GPIO_PinConfig.GPIO_PinNumber = 2;
    GPIO_Init(&UARTPins);

    /************ USART1_RX -> PA10 ************/
    UARTPins.GPIO_PinConfig.GPIO_PinNumber = 3;
    GPIO_Init(&UARTPins);
}

void UART_Init()
{
    USARTHandle.pUSARTx = USART2;

    USARTHandle.USART_Config.USART_Mode = USART_MODE_TXRX;

    USARTHandle.USART_Config.USART_Baud = USART_STD_BAUD_9600;

    USARTHandle.USART_Config.USART_NoOfStopBits = 1;

    USARTHandle.USART_Config.USART_WordLength = USART_WORDLEN_8BITS;

    USARTHandle.USART_Config.USART_ParityControl = USART_PARITY_DISABLE;

    USARTHandle.USART_Config.USART_HWFlowControl = 0;

    USART_Init(&USARTHandle);
}



int main()
{

    UART_GPIO_Init();

	while (1) {

	}
}


